In [74]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()
import numpy as np
import pandas as pd

In [75]:
df = pd.read_csv('data.csv', encoding = 'Windows-1251').fillna(0)
df.head()

,job_title,hh_title,age,salary,exp. period,title of exp.
0,data analyst,Data analyst,22.0,0.0,2.67,Data Analyst
1,data analyst,Data Analyst,21.0,0.0,0.83,Junior Data Analyst
2,data analyst,Data Analyst,30.0,0.0,7.50,Data Analyst
3,data analyst,Data Analyst,24.0,0.0,4.92,Data Analyst
4,data analyst,Data Analyst,27.0,450000.0,3.25,Business Intelligence Analyst

In [76]:
print(list(df.columns))
#['job_title', 'age', 'salary', 'exp. period']

['job_title', 'hh_title', 'age', 'salary', 'exp. period', 'title of exp.']

In [77]:
sdf = df.loc[:,['job_title', 'age', 'salary', 'exp. period']]
sdf.head()

      job_title   age    salary  exp. period
0  data analyst  22.0       0.0         2.67
1  data analyst  21.0       0.0         0.83
2  data analyst  30.0       0.0         7.50
3  data analyst  24.0       0.0         4.92
4  data analyst  27.0  450000.0         3.25

In [78]:
X = sdf.drop('job_title', axis=1)
X.head()

    age    salary  exp. period
0  22.0       0.0         2.67
1  21.0       0.0         0.83
2  30.0       0.0         7.50
3  24.0       0.0         4.92
4  27.0  450000.0         3.25

In [79]:
y=sdf['job_title']
y.head()

0    data analyst
1    data analyst
2    data analyst
3    data analyst
4    data analyst
Name: job_title, dtype: object

In [80]:
from sklearn.model_selection import train_test_split
Xtrain,Xtest,ytrain,ytest = train_test_split(X,y, train_size=0.8, stratify = y)

In [81]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(Xtrain,ytrain)
y_model = model.predict(Xtest)
from sklearn.metrics import accuracy_score
accuracy_score(ytest,y_model)

0.325

In [82]:
from sklearn.model_selection import cross_val_score
b = cross_val_score(model,X,y, cv=10)
b.mean()

0.344

In [83]:
import warnings
warnings.filterwarnings('ignore')
from sklearn.neighbors import KNeighborsClassifier
model_n = KNeighborsClassifier(n_neighbors = 3)
model_n.fit(X,y)
y1_model = model_n.predict(X)
accuracy_score(y,y1_model)

0.865

In [84]:
from sklearn.model_selection import LeaveOneOut
a = cross_val_score(model,X,y, cv=LeaveOneOut())
a.mean()

0.324